///Задача 25: 
// Напишите цикл, который принимает на вход два числа (A и B)
// и возводит число A в натуральную степень B.

// System.Console.WriteLine("Введите число");
// int A = Convert.ToInt32(Console.ReadLine());

// System.Console.WriteLine("Введите степень");
// int B = Convert.ToInt32(Console.ReadLine());

// for (int i = 1; i <= B ; i++)
// {
//     double C = Math.Pow(A, i);
//     System.Console.WriteLine(C);
// }


// System.Console.WriteLine("Введите число");
// int A = Convert.ToInt32(Console.ReadLine());

// System.Console.WriteLine("Введите степень");
// int B = Convert.ToInt32(Console.ReadLine());

// int i = 1;
// double C = A;

// while (i <= B)
// {
//     C = Math.Pow(A, i);
//     i++;
// }
// System.Console.WriteLine(C);


///Задача 27: 
// Напишите программу, которая принимает
// на вход число и выдаёт сумму цифр в числе.

// System.Console.WriteLine("Введите число");
// int N = Convert.ToInt32(Console.ReadLine());

// int result = 0;

// while (N > 0)
// {
//     result = result + N % 10;
//     N = N / 10;
// }
// System.Console.WriteLine(result);


///Задача 29:
//  Напишите программу, которая задаёт
// массив из 8 элементов и выводит их 
//   на экран.


// System.Console.WriteLine("Введите 8 чисел");
// int N = Convert.ToInt32(Console.ReadLine());
// string Number = Convert.ToString(N);
// int[] Array = new int[Number.Length];
// int i;

// for (i = 0; i < Number.Length; i++)
// {
//     Array[i] = Convert.ToInt32(Number[i].ToString());
//     Console.Write(Array[i] + " ");
// }
